gdmatrix-common/src/main/resources/cat/mobileid/signPdf.xml

<?xml version="1.0" ?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
  <S:Body>
    <ns2:signPdf xmlns:ns2="http://idbcn.bcn.cat">
      <policy>${policy}</policy>
      <docType>${docType}</docType>
      <docNum>${docNum}</docNum>
      <subject>${subject}</subject>
      <source>${source}</source>
      <pdfb64>${pdfb64}</pdfb64>
    </ns2:signPdf>
  </S:Body>
</S:Envelope>